<?php

/**
 * Проект: joker2620/bot2018
 * Author: Joker2620;
 * PHP version 7.1;
 *
 * @category AutoSing
 * @package  Joker2620\Source\Plugins\AutoSing
 * @author   Joker2620 <joker2000joker@list.ru>
 * @license  https://github.com/joker2620/bot2018/blob/master/LICENSE MIT
 * @link     https://github.com/joker2620/bot2018 #VKCHATBOT
 */

/**
 * База картинок
 *
 * В данной константе, в виде массива расположена база картинок.
 * Формат базы
 * ['Название_картинки.png', ширина, высота, первая_точка_позиции_текста,
 * вторая_точка_позиции_текста, угол_наклона_текста]
 */
return [
    /*  ['sign/8.png','maxweight','maxheight','posx','posy','rorate']
        ['sign/0.png',320,247, 303+(320/4), 586+(247/2),24],
        ['sign/1.png', 201,111,333+(201/4),110+80,19],
        ['sign/2.png',409,177,294+(409/4),420+(177/2),-10],
        ['sign/3.png',606,310,14+(606/4),498+(310/2),7],
        ['sign/4.png',281,121,589+(281/4),282+(121/2),10],
        ['sign/5.png',386,202,165+(386/4),461+(202/2),-9],
        ['sign/6.png',284,188,604+(284/4),413+(188/2),25],
        ['sign/7.png',191,90,206+(191/4),83+(90/2),-9],
        ['sign/8.png',328,75,127+(328/4),288+(75/2),-1] */
    ['0.png', 320, 247, 383, 709.5, 24],
    ['1.png', 201, 111, 383.25, 190, 19],
    ['2.png', 409, 177, 396.25, 508.5, -10],
    ['3.png', 606, 310, 165.5, 653, 7],
    ['4.png', 281, 121, 659.25, 342.5, 10],
    ['5.png', 386, 202, 261.5, 562, -9],
    ['6.png', 284, 188, 675, 507, 25],
    ['7.png', 191, 90, 253.75, 128, -9],
    ['8.png', 328, 75, 209, 325.5, -1]
];
